/* Баллада о плюсах плюсов */

#include <music/MINDBRAND.h>

int main() {
  return 0;
}

/*  
  Вступление
Добро пожаловать в Плюсы!

  1 Куплет
Стой-ка, джун неопытный, покажи свой ориентир.
Думаешь, что питон — это целый божий мир?
Пойдём же в память глубже, будем ручками считать.
В смысле, нет? Ну и сиди, гляди, как сборщик ест твой хлам!
Секунду, мидл мученный, ты забыл про тот result
Как тебе плюсы на деле? Шрамы скрыть уже нельзя?
Опять UB настигло, а double-free так задолбал!
Беги скорей отсюда, он еще тот ОЗУ-вандал.
Блокчейн, криптография, ОС, движки, сервера —
Всё это можно прогать и без лишнего добра.
Почему не пишешь в Си-плюс-плюс? Слишком низко для тебя?
Оставайся в своём шарпе, но Сакутин кода не простит.
(От Си нас не спасли!)

  1 Припев
Ах, UB всегда
Сбивает меня,
И validator опять ругнётся.
А отладка вызывает лишь паничный крик.
Deadlock-саркофаг,
Полуночный дебаг,
И наконец-то класс написан!
Ну сколько можно прогать cmake, уже достало всё!

  2 Куплет
Опять стажер кричит: "ТУТ ПЕРЕДЕЛАТЬ НАДО ВСЕ С НУЛЯ!"
Ты не трогай тот goto, - предупреждаю сразу я.
Он там с девяностых вписан, без него всё враз падёт.
Лучше делай пайтон API - вызвав matplotlib-dot-plot
Уже время идти? «Не стой на месте, а компиль!»
Если бред в коде висит — «Рефактори, не тупи!»
Если боишься делать — «Уходи и не мешай!»
Каждый хочет чистый код, и Мартин в книге строит рай!
(int z, int x, int y!)

  2 Припев
Ах, писал я вновь,
Стирал кисть в кровь,
И наконец рабочий метод...
Шаблон один инстанцируется в сотню строк!
Решили leetcode,
Гордились собой,
Нашли идеальный аллокатор...
Ну сколько можно прогать cmake, уже достало всё!

  Bridge
А мы всё пишем, код встрял в гортани поперёк.
MSVC Warn: «уж слишком много move на десять строк»
Но мы же знаем, где лучше copy, а где paste.
Как надоело... Пора уже уйти на Rust

  3 Припев
Плюсы заменить,
Инварианты забыть,
Хотел бы я всё, всегда и сразу...
Но legacy-код изменить пока нельзя!
SOLID пренебречь,
У памяти течь,
Ну почему все так херово?
Проект хочу закрыть... И пойти на Zig...

  Завершение:
Добро пожаловать в Плюсы!
Добро пожаловать в Плюсы!
В Плюсы!
Добро пожаловать в Плюсы!
Добро пожаловать в Плюсы!
В Плюсы!
*/
